import React from "react";
import style from "./Ouestions.module.scss";
import Item from "./Item";

const Questions = () => {
  const qaList = [
    {
      q: "Як користуватися додатком?",
      a: (
        <div>
          - Завантаж додаток з Google Play <br />- Встанови додаток на своєму
          телефоні з ОС Android
          <br /> - Зареєструйся як новий користувач додатку та розкажи про себе
          і своїх дітей, щоб додаток міг знайти підходящу тобі групу догляду за
          дітьми
          <br /> - Обери собі групу поруч із твоїм домом чи роботою
          <br /> - Отримай контакти інших учасників групи, домовляйся із ними
          про умови спільного догляду
          <br /> - Насолоджуйся улюбленою роботою чи навчанням, поки твої діти
          під наглядом турботливих матусь!
          <br />
        </div>
      ),
    },
    {
      q: "Навіщо вам мої особисті дані та геолокація?",
      a: (
        <div>
          - Щоб підібрати тобі та твоїй дитині саме ту групу, якої ви
          потребуєте, ми маємо знати все про ваші потреби 😊
          <br /> Не хвилюйся, твої особисті дані захищені. Ми не разголошуємо та
          не передаємо твої дані третім особам, не використовуємо для розсилок
          реклами тощо.
        </div>
      ),
    },
    {
      q: "Яку відповідальність за моїх дітей несуть розробники додатку?",
      a: (
        <div>
          {" "}
          - За жодних обставин ми не несемо жодної відповідальності перед
          користувачами додатку та третіми особами за будь-які збитки чи шкоду
          будь-якого роду, понесені в результаті використання мобільного додатку
          або будь-якої інформації, наданої в мобільному додатку. Тому залишаючи
          свою дитину з іншими користувачами додатку, будь дуже уважною,
          пильною, та сама пересвідчись у безпеці своєї дитини!
        </div>
      ),
    },
    {
      q: "Скільки мені буде це коштувати та в яких країнах працює додаток?",
      a: (
        <div>
          - Користування додатком повністю безкоштовно та не лімітовано за
          часом. Додаток працює у будь-якій точці нашої планети, в усіх країнах,
          де в тебе буде мобільний зв’язок.
        </div>
      ),
    },
  ];

  return (
    <div>
      <h2 className={style.title}>Питання, які часто задають</h2>
      <ul className={style.questions}>
        {qaList.map((item, id) => {
          return <Item id={id} item={item} key={id} />;
        })}
      </ul>
    </div>
  );
};

export default Questions;
