import React from "react";
import style from "./Protocol.module.scss";
import { Link } from "react-router-dom";

const Privacy = () => {
  return (
    <div className={style.container}>
      <p>
        Управління цим застосунком “Мама не вдома” (далі – «Застосунок»)
        здійснюється фізичною особою Красноноженко Олексієм Миколайовичем, який
        зареєстрований і діє відповідно до вимог законодавства України (далі -
        «Управитель»). Управитель з великою повагою ставиться до конфіденційної
        (персональної) інформації всіх без винятку осіб, які зареєструвались у
        Застосунку, а також тих, хто користується наданими Застосунком
        сервісами; в зв'язку з чим, Управитель прагне захищати конфіденційність
        персональних даних (відомостей чи сукупність відомостей про фізичну
        особу, яка ідентифікована або може бути конкретно ідентифікована), тим
        самим створивши і забезпечивши максимально комфортні умови використання
        сервісів Застосунку кожному користувачеві.
      </p>
      <p>
        У цій Політиці конфіденційності та захисту персональних даних (далі –
        «Політика») встановлено порядок здійснення Управителем обробки
        персональних даних, види персональних даних, які збираються, цілі
        використання таких персональних даних, взаємодія Управителя з третіми
        особами, заходи безпеки для захисту персональних даних, умови доступу до
        персональних даних, а також, контактна інформація для користувача щодо
        отримання доступу, внесення змін, блокування або видалення своїх
        персональних даних та звернення з будь-якими питаннями, які можуть
        виникнути у Вас щодо практики захисту персональних даних.
      </p>
      <h3>Збір та використання персональних даних</h3>
      <p>
        Володільцем та розпорядником персональних даних користувачів Застосунку
        є фізична особа Красноноженко Олексій Миколайович. При використанні
        користувачем сервісів Застосунку Управителем здійснюється обробка даних
        користувача, а саме:
        <ul>
          <li>
            даних, що надаються користувачем як при заповненні реєстраційних
            форм, так і в процесі користування сервісами;
          </li>
          <li>даних про геолокацію користувача.</li>
          <p>
            Управитель збирає тільки ті персональні дані (наприклад, Ваше ім'я і
            нікнейм, пароль доступу, адреса електронної пошти, номер контактного
            телефону, вік та стать дітей), які свідомо і добровільно надані{" "}
            <u>Вами як суб'єктом персональних даних</u> в цілях використання
            сервісів Застосунку, що відповідно до вимог законодавства є згодою
            суб'єкта персональних даних на обробку своїх персональних даних
            відповідно до сформульованої в цій Політиці мети їх обробки.
          </p>
        </ul>
      </p>

      <p>
        <b>Звертаємо Вашу увагу:</b> Управитель обмежується збором мінімального
        обсягу інформації, необхідного виключно для виконання запиту суб'єкта
        персональних даних. У будь-якому випадку, коли запитується необов'язкова
        до надання інформація, користувача буде повідомлено в момент збору такої
        інформації.
      </p>
      <p>
        Управитель не збирає будь-яку інформацію, до обробки якої,
        законодавством встановлені певні вимоги, як-то інформацію про расове або
        етнічне походження, політичні, релігійні або світоглядні переконання,
        членство в політичних партіях та професійних спілках, засудження до
        кримінального покарання в скоєнні злочину або засудження до
        кримінального покарання, а також даних, що стосуються здоров'я,
        статевого життя, біометричних або генетичних даних (відповідно до статті
        7 Закону України «Про захист персональних даних»)
      </p>

      <h3>Обробка персональних даних</h3>
      <p>
        Обробка і зберігання наданих персональних даних здійснюється в центрах
        обробки даних німецької компанії Contabo, де розміщується обладнання, що
        забезпечує функціонування сервісів Застосунку. Відповідні послуги
        віртуального приватного серверу надаються компанією{" "}
        <Link to="contabo.com">Contabo</Link> на умовах, які забезпечують
        необхідний за європейським законодавством рівень захисту персональних
        даних користувача. Надані персональні дані обробляються і можуть
        зберігатись в Базі персональних даних чи окремій таблиці Бази даних
        Застосунку.
      </p>
      <p>
        {" "}
        Місце зберігання та обробки персональних даних визначене компанією
        Contabo за посиланням:{" "}
        <Link to="https://contabo.com/en/locations/">
          {" "}
          https://contabo.com/en/locations/
        </Link>
      </p>

      <h3>Цілі використання персональних даних</h3>
      <p>
        Ваші персональні дані використовуються в цілях забезпечення надання
        сервісів Засосуну, обміну інформацією та організації спільного догляду
        за вашими дітьми відповідно та на виконання законів України, у тому
        числі, але не виключно: «Про захист персональних даних», «Про
        ратифікацію Конвенції про захист осіб у зв'язку з автоматизованою
        обробкою персональних даних та Додаткового протоколу до Конвенції про
        захист осіб у зв'язку з автоматизованою обробкою персональних даних
        стосовно органів нагляду та транскордонних потоків даних», «Про
        інформацію», «Про рекламу», «Про телекомунікації», «Про захист
        інформації в інформаційно-телекомунікаційних системах», «Про державну
        підтримку засобів масової інформації та соціальний захист журналістів»,
        а також відповідно до{" "}
        <Link to="/terms">Правил використання Застосунку</Link> та інших актів,
        що регулюють діяльність Управителя.
      </p>
      <h3>Термін зберігання персональних даних</h3>
      <p>
        Персональні дані зберігаються на термін не більше, ніж це необхідно
        відповідно до мети їх обробки.
      </p>
      <p>
        Після того, як суб'єкт персональних даних перестав бути користувачем
        Застосунку шляхом видалення свого облікового запису у Застосунку, його
        персональні дані також автоматично видаляються.
      </p>
      <h3>Безпека неповнолітніх</h3>
      <p>
        Застосунок не призначений для використання неповнолітніми користувачами
        безпосередньо. Користувачам Застосунку є батьки дітей, що є повнолітніми
        особами. Управитель дуже серйозно ставиться до питань безпеки, особливо
        щодо осіб, які не досягли повноліття, в зв'язку з чим, зі свого боку,
        Управитель звертається до батьків із закликом проявляти обережність і
        старанність, організовуючи догляд за дітьми через Застосунок. «Мама не
        вдома» не схвалює, не гарантує та не перевіряє кваліфікацію користувачів
        або точність наданої ними інформації.
      </p>
      <h3>
        Взаємодія Управителя з третіми особами стосовно персональних даних
      </h3>
      <p>
        Управитель не здійснює передачу персональних даних третім особам, крім
        випадків, коли така передача є вимогою законодавства, на прохання
        суб'єкта персональних даних або в інших випадках, викладених в цій
        Політиці. Управитель розуміє, що особиста інформація є цінністю і
        невід'ємним змістом, в тому числі, особистих немайнових прав будь-якої
        фізичної особи, тому вживає всіх можливих заходів для захисту особистої
        інформації користувачів, добровільно і усвідомлено переданої останніми
        Управителю.
      </p>
      <p>
        {" "}
        У застосунку можуть бути посилання на інші веб-сайти, соціальні мережі
        чи інші застосунки (виключно в інформаційних цілях). При переході по
        посиланню на ці ресурси дія цієї Політики на них поширюватися не буде. У
        зв'язку з чим, Управитель рекомендує переглядати політику в сфері
        конфіденційності і персональних даних кожного веб-ресурсу перед тим, як
        передавати будь-які персональні дані, за якими Вас можуть
        ідентифікувати.
      </p>

      <h3>Захист персональних даних</h3>
      <p>
        Управитель використовує загальноприйняті стандарти технологічного та
        операційного захисту інформації та персональних даних від втрати,
        неправильного використання, зміни або знищення. Однак, не дивлячись на
        всі зусилля, Управитель не може гарантувати абсолютну захищеність від
        будь-яких загроз, що виникають поза межами регулювання Управителя.
      </p>
      <p>
        {" "}
        Управитель забезпечує застосування всіх відповідних зобов'язань щодо
        дотримання конфіденційності, а також технічних і організаційних заходів
        безпеки для запобігання несанкціонованого або незаконного розголошення
        або обробки такої інформації та даних, їх випадкової втрати, знищення
        або пошкодження.
      </p>

      <p>
        Управитель надає доступ до інформації і персональних даних тільки
        уповноваженим працівникам, які дали згоду на забезпечення
        конфіденційності такої інформації та даних відповідно до вимог
        Управителя. Поширення персональних даних без згоди суб'єкта персональних
        даних або уповноваженої ним особи дозволяється у випадках, визначених
        законом, і лише (якщо це необхідно) в інтересах національної безпеки,
        економічного добробуту та прав людини.
      </p>
      <h3>Умови доступу до персональних даних</h3>
      <p>
        Порядок доступу до персональних даних третіх осіб визначається умовами
        згоди користувача, наданої володільцю персональних даних на обробку цих
        даних, або відповідно до вимог закону.{" "}
      </p>
      <p>
        Користувач має право на одержання будь-яких відомостей про себе у
        будь-якого суб'єкта відносин, пов'язаних з персональними даними, за
        умови зазначення прізвища, ім'я та по батькові, місця проживання (місця
        перебування) і реквізитів документа, що посвідчує фізичну особу, яка
        подає запит, крім випадків, установлених законом. Також доступ до
        персональних даних користувача забезпечується у Застосунку через
        перегляд та редагування (актуалізацію) даних його акаунту.
      </p>
      <p>
        Доступ користувача до даних про себе здійснюється безоплатно. Відстрочка
        доступу користувача до своїх персональних даних не допускається.
      </p>
      <p>
        Відстрочка доступу до персональних даних третіх осіб допускається у
        разі, якщо необхідні дані не можуть бути надані протягом тридцяти
        календарних днів з дня надходження запиту. При цьому загальний термін
        вирішення питань, порушених у запиті, не може перевищувати сорока п'яти
        календарних днів.
      </p>
      <p>
        Повідомлення про відстрочку доводиться до відома третьої особи, яка
        подала запит, у письмовій формі з роз'ясненням порядку оскарження такого
        рішення.
      </p>
      <p>
        Рішення про відстрочення або відмову у доступі до персональних даних
        може бути оскаржено до Уповноваженого Верховної Ради України з прав
        людини або суду.
      </p>

      <h3>Права суб'єкта персональних даних</h3>
      <p>
        Управитель доводить до Вашого відома про Ваші права, як суб'єкта
        персональних даних, які врегульовані Законом України «Про захист
        персональних даних», а саме:
      </p>
      <ol>
        <li>
          знати про джерела збирання, місцезнаходження своїх персональних даних,
          мету їх обробки, місцезнаходження або місце проживання (перебування)
          володільця чи розпорядника персональних даних або дати відповідне
          доручення щодо отримання цієї інформації уповноваженим ним особам,
          крім випадків, встановлених законом;
        </li>
        <li>
          {" "}
          отримувати інформацію про умови надання доступу до персональних даних,
          зокрема інформацію про третіх осіб, яким передаються його персональні
          дані;
        </li>
        <li> на доступ до своїх персональних даних;</li>
        <li>
          отримувати не пізніш як за тридцять календарних днів з дня надходження
          запиту, крім випадків, передбачених законом, відповідь про те, чи
          обробляються його персональні дані, а також отримувати зміст таких
          персональних даних;
        </li>
        <li>
          пред'являти вмотивовану вимогу володільцю персональних даних із
          запереченням проти обробки своїх персональних даних;
        </li>
        <li>
          пред'являти вмотивовану вимогу щодо зміни або знищення своїх
          персональних даних будь-яким володільцем та розпорядником персональних
          даних, якщо ці дані обробляються незаконно чи є недостовірними;
        </li>
        <li>
          {" "}
          на захист своїх персональних даних від незаконної обробки та
          випадкової втрати, знищення, пошкодження у зв'язку з умисним
          приховуванням, ненаданням чи несвоєчасним їх наданням, а також на
          захист від надання відомостей, що є недостовірними чи ганьблять честь,
          гідність та ділову репутацію фізичної особи;
        </li>
        <li>
          звертатися із скаргами на обробку своїх персональних даних до
          Уповноваженого Верховної Ради України з прав людини або до суду;
        </li>
        <li>
          {" "}
          застосовувати засоби правового захисту в разі порушення законодавства
          про захист персональних даних;
        </li>
        <li>
          вносити застереження стосовно обмеження права на обробку своїх
          персональних даних під час надання згоди;
        </li>
        <li>відкликати згоду на обробку персональних даних;</li>
        <li> знати механізм автоматичної обробки персональних даних;</li>
        <li>
          на захист від автоматизованого рішення, яке має для нього правові
          наслідки.
        </li>
      </ol>
      <p>
        Для оновлення, отримання доступу, внесення змін, блокування або
        видалення своїх персональних даних, відкликання згоди на обробку
        персональних даних, яка були Вами надана Управителю відповідно до цієї
        Політики, або в разі наявності будь-яких зауважень, побажань або
        претензій щодо Ваших персональних даних, які обробляються Управителем,
        будь ласка, звертайтеся до Управителя по електронній пошті
        app.mama.ne.vdoma@gmail.com
      </p>

      <h3>Зміна Політики</h3>
      <p>
        До цієї Політики періодично та без попереднього повідомлення користувача
        про таке можуть вноситись зміни та доповнення, у тому числі, при зміні
        вимог законодавства.{" "}
      </p>
      <p>
        У випадку внесення істотних змін до цієї Політики Управителем буде
        розміщено повідомлення на веб-сайті Застосунку та зазначено термін
        набрання цими змінами чинності. Якщо протягом зазначеного термну Ви не
        відмовитеся від їх прийняття в письмовій формі, це означатиме, що Ви
        погоджуєтеся з відповідними змінами Політики.
      </p>
      <p style={{ "margin-bottom": "5rem"}}>
        Просимо час від часу переглядати Політику для того, щоб бути в курсі
        будь-яких змін або доповнень.
      </p>
    </div>
  );
};

export default Privacy;
