import React from "react";
import style from "./Protocol.module.scss";

const TermsUse = () => {
  return (
    <div className={style.container}>
      <h3>Правила використання Застосунку «Мама не вдома»:</h3>
      <p>
        <b>Ласкаво просимо</b> до мобільного Android застосунку{" "}
        <b>«Мама не вдома»</b>
        («Застосунок»). Користуючись цим Програмним Забезпеченням, Ви
        погоджуєтеся дотримуватися наведених нижче умов користування. Якщо Ви не
        згодні з цими умовами, будь ласка, не використовуйте Застосунок.
      </p>
      <h3>Обов’язки користувача:</h3>
      <p>
        Застосунок розроблено для того, щоб допомогти місцевим батьківським
        спільнотам громадян України здійснювати нагляд за дітьми в денний час.
        Користувачі несуть повну відповідальність за свою взаємодію та
        домовленості з іншими користувачами Застосунку.
      </p>
      <h3>Безпека:</h3>
      <p>
        Ми закликаємо користувачів проявляти обережність і старанність,
        організовуючи догляд за дітьми через Застосунок. «Мама не вдома» не
        схвалює, не гарантує та не перевіряє кваліфікацію користувачів або
        точність наданої ними інформації.
      </p>
      <h3>Відмова від відповідальності:</h3>
      <p style={{ marginBottom: "5rem" }}>
        Застосунок та його розробники не несуть відповідальності за будь-яку
        шкоду, травми чи збитки, спричинені використанням Застосунку або
        будь-якою взаємодією з іншими користувачами. Користувачі використовують
        Застосунок на власний ризик.
      </p>
    </div>
  );
};

export default TermsUse;
