import React from "react";

const Privacy = () => {
  return (
    <div>
      Політика конфіденційності мобільного застосунку “Мама-не-вдома”:
      Володільцем персональних даних є розробники цього Застосунку в особі
      розпорядника персональних даних, громадянина України фізичної особи
      Красноноженко Олексія (email: app.mama.ne.vdoma@gmail.com), що збирає
      персональні дані для суто особистої діяльності, без будь-якого зв’язку з
      професійною чи комерційною діяльністю. Мета (ціль) обробки персональних
      даних: Надання інформації щодо імен, геолокації, кількості дітей та
      контактних даних іншим користувачам Застосунку, розташованим по сусідству,
      для можливості об’єднання таких користувачів у групи з метою організації
      спільного догляду за їх дітьми, поки дорослі працюють. Надання таких даних
      користувачем є базовою вимогою для використання Застосунку. У випадку
      ненадання відповідних особистих даних щодо геолокації, контактів та
      інформації про вік дітей і їх кількість, функціональність Застосунку буде
      недоступною користувачу. Способи і терміни обробки персональних даних:
      Збір, накопичення, поширення, зміна та знищення персональних даних
      відбувається на базі інформаційної автоматизованої системи Застосунку.
      Термін обробки персональних даних обмежується: для акаунтів, що не
      використовуються користувачем - 6 календарних місяців; для акаунтів, що
      перебувають у використанні - термін обробки персональних даних
      встановлюється користувачем. Права суб’єктів персональних даних:
      Користувачі Застосунку мають право: знати про джерела збирання,
      місцеперебування своїх персональних даних, мету їх обробки; отримувати
      інформацію про умови надання доступу до персональних даних, зокрема
      інформацію про третіх осіб, яким передаються його персональні дані; на
      доступ до своїх персональних даних; пред’являти вмотивовану вимогу
      володільцю персональних даних із запереченням проти обробки своїх
      персональних даних, а також щодо зміни або знищення своїх персональних
      даних, якщо вони обробляються незаконно чи є неправдивими; на захист своїх
      персональних даних від незаконної обробки та випадкової втрати, знищення,
      пошкодження, а також всі інші права згідно з ст.8 Закону України «Про
      захист персональних даних» та згідно General Data Protection Regulation
      2016/679. В даному Застосунку застосовується система автоматизованого
      індивідуального вироблення й ухвалення рішень, у тому числі профайлінг.
      Тому надаючи згоду на обробку персональних даних в Застосунку, користувач
      висловлює свою згоду підлягати таким рішенням. Взаємодія з третіми
      особами: Персональні дані суб’єктів – користувачів Застосунку надаються
      виключно іншим користувачам Застосунку для їх особистої діяльності. Ці
      персональні дані не можуть бути передані будь-яким третім особам, країнам
      чи організаціям для комерційних, дослідницьких чи будь-яких інших цілей.
      Приймаючи та підтверджуючи політику конфіденційності цього Застосунку,
      кожен користувач також підтверджує, що отримані ним персональні дані інших
      користувачів Застосунку не підлягають передачі будь-яким третім особам.
      Безпека даних: Ми вживаємо розумних заходів для захисту вашої особистої
      інформації. Однак ми не можемо гарантувати абсолютну безпеку даних
      користувачів. Тому користувачі повинні вживати заходів обережності,
      надаючи особисту інформацію в Застосунку, включаючи таку, що надається
      користувачами один одному. Погоджуючись із Політикою конфіденційності,
      користувач надає свою згоду на збирання, обробку, накопичення, зберігання,
      використання, поширення та видалення персональних даних відповідно до
      зазначеного вище документу.
    </div>
  );
};

export default Privacy;
