import React from "react";
import style from './scss/Terms.module.scss'

const TermsUse = () => {
  return (
    <div className={style.terms}>
      <h2>Умови використання мобільного додатку “Мама-не-вдома”:</h2>
      <p>
        <b>Ласкаво просимо</b> до мобільного Android додатку <b>«Мама не вдома»
        («Додаток»)</b>. Користуючись цим Програмним Забезпеченням, Ви погоджуєтеся
        дотримуватися наведених нижче умов користування. Якщо Ви не згодні з
        цими умовами, будь ласка, не використовуйте додаток.
      </p>
      <h2>Обов’язки користувача:</h2>
      <p>
        Додаток розроблено для того, щоб допомогти місцевим батьківським
        спільнотам громадян України здійснювати нагляд за дітьми в денний час.
        Користувачі несуть повну відповідальність за свою взаємодію та
        домовленості з іншими користувачами Застосунку.
      </p>
      <h2>Безпека:</h2>
      <p>
        Ми закликаємо користувачів проявляти обережність і старанність,
        організовуючи догляд за дітьми через Застосунок. «Мама не вдома» не
        схвалює, не гарантує та не перевіряє кваліфікацію користувачів або
        точність наданої ними інформації.
      </p>
      <h2>Відмова від відповідальності:</h2>
      <p>
        Застосунок та його розробники не несуть відповідальності за будь-яку
        шкоду, травми чи збитки, спричинені використанням Застосунку або
        будь-якою взаємодією з іншими користувачами. Користувачі використовують
        Застосунок на власний ризик.
      </p>
    </div>
  );
};

export default TermsUse;
