import React from "react";
import style from "./Reviews.module.scss";

const h3 = [
  "Інна Денисюк",
  "Олена Наконечна",
  "Марія Ковальчук",
  "Богдана Лучкова",
  "Діана Назар",
  "Анна Звадюк",
];
const p = [
  "“Мама не вдома” - незамінний помічник для мам. Знайшла допомогу для своїх дітей легко і швидко. Задоволена результатом!",
  "Мені зручно знаходити допомогу для дітей, за допомогою цього додатка. Створила власну групу. Великий плюс для матерів!",
  "Організація догляду за дітьми ще ніколи не була такою легкою. Я знаходжу жінок, готових допомогти, коли потрібно. ",
  "Завдяки цьому додатку, я маю змогу працювати, не втрачаючи контроль над доглядом за дітьми. Рекомендую!",
  "Маю змогу працювати і знати, що мої діти в надійних руках завдяки цьому додатку. Велика підтримка для активних мам.",
  "Завдяки цьому додатку я швидко знаходжу допомогу для дітей. Він відкрив нові можливості спілкування для матерів.",
];

const Review = ({ item, i }) => {
  return (
    <article key={i}>
      <img className="person-img" src={item} alt="person"></img>
      <h3 className="h3">{h3[i]}</h3>
      <p className="p">{p[i]}</p>
    </article>
  );
};

export default Review;
